// Тут буде знаходитись логіка роботи вашого express-серверу.

// Створіть функцію setupServer, в якій буде створюватись express сервер.
// Ця функція має в себе включати:
// - Створення серверу за допомогою виклику express()
// - Налаштування cors та логгера pino.
// - Обробку неіснуючих роутів (повертає статус 404 і відповідне повідомлення)
/* {
  message: 'Not found',
} */
// - Запуск серверу на порті, вказаному через змінну оточення PORT або 3000, якщо такої змінної не зазначено
// - При вдалому запуску сервера виводити в консоль рядок “Server is running on port {PORT}”, де {PORT} - це номер вашого порту.

// Не забудьте вказати змінну оточення в файлі .env.example


// export function setupServer() { };
